Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 2) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 16) 304         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 512, 16) 64          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 512, 512, 16) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 16) 48          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 16) 2320        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 16) 64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 512, 512, 16) 0           conv2d_1[0][0]                   
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 16) 64          add[0][0]                        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 16) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 32) 4640        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 32) 128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 32) 544         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 32) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 256, 256, 32) 128         conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 32) 9248        activation_2[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 32) 0           batch_normalization_4[0][0]      
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 256, 32) 128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 32) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 64) 18496       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 64) 256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 64) 2112        add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 128, 64) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 64) 256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 64) 36928       activation_4[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 128, 64) 0           batch_normalization_7[0][0]      
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 64) 256         add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128, 128, 64) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 128)  73856       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 128)  512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 128)  8320        add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64, 64, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 128)  512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 128)  147584      activation_6[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 128)  0           batch_normalization_10[0][0]     
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 128)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 256)  295168      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 32, 256)  1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 256)  33024       add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 256)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 256)  1024        conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 256)  590080      activation_8[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 256)  0           batch_normalization_13[0][0]     
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 256)  1024        add_4[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 256)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 256)  590080      activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 256)  1024        conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 256)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 256)  590080      activation_10[0][0]              
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 64, 64, 256)  0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 64, 64, 256)  33024       add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 64, 64, 256)  65792       up_sampling2d[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 64, 64, 256)  0           conv2d_17[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 64, 256)  0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 64, 1)    257         activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 64, 64, 1)    0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
multiply (Multiply)             (None, 64, 64, 128)  0           add_3[0][0]                      
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 384)  0           up_sampling2d[0][0]              
                                                                 multiply[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 384)  1536        concatenate[0][0]                
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 64, 64, 384)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 64, 256)  884992      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 256)  1024        conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 64, 64, 256)  98560       concatenate[0][0]                
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 64, 64, 256)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 256)  1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 64, 64, 256)  590080      activation_14[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 64, 64, 256)  0           batch_normalization_18[0][0]     
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 128, 128, 256 0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 128, 128, 256 16640       add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 128, 128, 256 65792       up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
add_7 (Add)                     (None, 128, 128, 256 0           conv2d_23[0][0]                  
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128, 256 0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 128, 128, 1)  257         activation_15[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 1)  0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 128, 128, 64) 0           add_2[0][0]                      
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 320 0           up_sampling2d_1[0][0]            
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 320 1280        concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 320 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 128, 128, 128 368768      activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 128, 128 512         conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 128, 128, 128 41088       concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 128 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 128, 128, 128 512         conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 128, 128, 128 147584      activation_18[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 128, 128, 128 0           batch_normalization_21[0][0]     
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 256, 256, 128 0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 256, 256, 128 4224        add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 256, 256, 128 16512       up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
add_9 (Add)                     (None, 256, 256, 128 0           conv2d_29[0][0]                  
                                                                 conv2d_30[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 256, 256, 128 0           add_9[0][0]                      
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 256, 256, 1)  129         activation_19[0][0]              
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 256, 256, 1)  0           conv2d_31[0][0]                  
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 256, 256, 32) 0           add_1[0][0]                      
                                                                 activation_20[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 160 0           up_sampling2d_2[0][0]            
                                                                 multiply_2[0][0]                 
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 256, 256, 160 640         concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 256, 256, 160 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 256, 256, 64) 92224       activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 256, 256, 64) 256         conv2d_32[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 256, 256, 64) 10304       concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 256, 256, 64) 0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 256, 256, 64) 256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 256, 256, 64) 36928       activation_22[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 256, 256, 64) 0           batch_normalization_24[0][0]     
                                                                 conv2d_33[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 512, 512, 64) 0           add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 512, 512, 64) 1088        add[0][0]                        
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 512, 512, 64) 4160        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
add_11 (Add)                    (None, 512, 512, 64) 0           conv2d_35[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 512, 512, 64) 0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 512, 512, 1)  65          activation_23[0][0]              
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 512, 512, 1)  0           conv2d_37[0][0]                  
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 512, 512, 16) 0           add[0][0]                        
                                                                 activation_24[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 512, 512, 80) 0           up_sampling2d_3[0][0]            
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 512, 512, 80) 320         concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 512, 512, 80) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 512, 512, 32) 23072       activation_25[0][0]              
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 512, 512, 32) 128         conv2d_38[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 512, 512, 32) 2592        concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 512, 512, 32) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 512, 512, 32) 128         conv2d_40[0][0]                  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 512, 512, 32) 9248        activation_26[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 512, 512, 32) 0           batch_normalization_27[0][0]     
                                                                 conv2d_39[0][0]                  
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 512, 512, 1)  33          add_12[0][0]                     
==================================================================================================
Total params: 4,930,837
Trainable params: 4,923,541
Non-trainable params: 7,296
__________________________________________________________________________________________________